-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/average_distances.log
  log type:  text
 opened on:   8 Jun 2012, 17:18:46

. 
. use ../data/zip_business_patterns

. 
. replace distance = . if missing(emp,pop)
(0 real changes made)

. replace emp = . if missing(distance,pop)
(0 real changes made)

. replace pop = . if missing(distance,emp)
(0 real changes made)

. 
. foreach X of var emp pop est {
  2.         gen `X'distance = `X'*distance
  3. }

. 
. collapse (sum) ???distance emp est pop, by(sector msa)

. foreach X of var emp pop est {
  2.         replace `X'distance = `X'distance/`X'
  3. }
(375 real changes made)
(375 real changes made)
(375 real changes made)

. gen lnpopdistance = ln(popdistance)

. 
. poisson empdistance lnpopdistance i.sector
note: you are responsible for interpretation of noncount dep. variable

Iteration 0:   log likelihood = -1200.2867  
Iteration 1:   log likelihood = -1187.0249  
Iteration 2:   log likelihood = -1187.0096  
Iteration 3:   log likelihood = -1187.0096  

Poisson regression                                Number of obs   =        375
                                                  LR chi2(3)      =    4714.69
                                                  Prob > chi2     =     0.0000
Log likelihood = -1187.0096                       Pseudo R2       =     0.6651

-------------------------------------------------------------------------------
  empdistance |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
lnpopdistance |   .9148899   .0122864    74.46   0.000     .8908089    .9389708
              |
       sector |
           2  |  -.2351609   .0233901   -10.05   0.000    -.2810047   -.1893171
           3  |  -.2673947   .0236031   -11.33   0.000     -.313656   -.2211334
              |
        _cons |   .4960466   .0459441    10.80   0.000     .4059978    .5860954
-------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/average_distances.log
  log type:  text
 closed on:   8 Jun 2012, 17:18:47
-------------------------------------------------------------------------------------------
