-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/average_distances.log
  log type:  text
 opened on:   8 Jun 2012, 17:35:17

. 
. use ../data/zip_business_patterns

. 
. * nonzero number of establishments
. gen byte are = area if est>0 & !missing(est)
(25542 missing values generated)

. replace lndistance = . if missing(emp,pop)
(0 real changes made)

. replace emp = . if missing(lndistance,pop)
(0 real changes made)

. replace pop = . if missing(lndistance,emp)
(0 real changes made)

. 
. sort sector distance

. by sector: gen cumsum = sum(emp)

. egen maxcumsum = max(cumsum), by(sector)

. replace cumsum = cumsum/maxcumsum
(97510 real changes made)

. label var cumsum "Cumulative share of employment"

. 
. * empirical CDF of weighted distances in the three sectors
. tw (line cumsum lndistance if sector==1, sort) /*
> */ (line cumsum lndistance if sector==2, sort) /*
> */ (line cumsum lndistance if sector==3, sort) /*
> */, scheme(s2color) legend(order(1 "Agriculture" 2 "Industry" 3 "Services"))

. 
. * median weighted distances
. table sector if cumsum<=.5, c(max distance)

-------------------------
   sector | max(distance)
----------+--------------
        1 |      30.19405
        2 |      16.08478
        3 |      13.02499
-------------------------

. 
. foreach X of var emp pop est are {
  2.         gen `X'distance = `X'*lndistance
  3. }
(62340 missing values generated)

. 
. collapse (sum) ???distance emp est pop are, by(sector)

. foreach X of var emp pop est are {
  2.         replace `X'distance = exp(`X'distance/`X')
  3. }
(3 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)

. l sector ???distance

     +----------------------------------------------------+
     | sector   empdis~e   popdis~e   estdis~e   aredis~e |
     |----------------------------------------------------|
  1. |      1     27.528   14.68174   30.38156   20.51081 |
  2. |      2   14.04532   14.68174   16.03618   19.69105 |
  3. |      3    11.0805   14.68174   13.01792   20.52506 |
     +----------------------------------------------------+

. 
. log close
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/average_distances.log
  log type:  text
 closed on:   8 Jun 2012, 17:35:24
-------------------------------------------------------------------------------------------
