
. cd 
/Users/koren

. insheet using SparkleShare/County-Business-Patterns/2007/zbp07detail.txt
(12 vars, 3340643 obs)

. count
3340643

. edit

. codebook zip

--------------------------------------------------------------------------------------------------------------
zip                                                                                                (unlabeled)
--------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [501,99999]                  units:  1
         unique values:  39652                    missing .:  0/3340643

                  mean:   49749.3
              std. dev:   29032.3

           percentiles:        10%       25%       50%       75%       90%
                             10604     27103     48066     75951     92253

. edit

. drop n*

. insheet using SparkleShare/County-Business-Patterns/2007/zbp07detail.txt, clear
(12 vars, 3340643 obs)

. codebook naics

--------------------------------------------------------------------------------------------------------------
naics                                                                                              (unlabeled)
--------------------------------------------------------------------------------------------------------------

                  type:  string (str6)

         unique values:  1113                     missing "":  0/3340643

              examples:  "337122"
                         "452111"
                         "532490"
                         "621399"

. edit

. ren naics sector

. drop n*

. keep if right(sector,4)=="----"
unknown function right()
r(133);

. l in 1

     +--------------------+
     | zip   sector   est |
     |--------------------|
  1. | 501   ------     5 |
     +--------------------+

. keep if substr(sector,3,4)=="----"
(2874166 observations deleted)

. edit

. drop if sector=="------"
(39652 observations deleted)

. gen naics2 = value(left(sector,2))
unknown function value()
r(133);

. gen naics2 = real(left(sector,2))
unknown function left()
r(133);

. gen naics2 = real(substr(sector,1,2))

. edit

. drop sector

. reshape wide est, i(zip) j(naics2)
(note: j = 11 21 22 23 31 42 44 48 51 52 53 54 55 56 61 62 71 72 81 99)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   426825   ->   39652
Number of variables                   3   ->      21
j variable (20 values)           naics2   ->   (dropped)
xij variables:
                                    est   ->   est11 est21 ... est99
-----------------------------------------------------------------------------

. reshape long
(note: j = 11 21 22 23 31 42 44 48 51 52 53 54 55 56 61 62 71 72 81 99)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    39652   ->  793040
Number of variables                  21   ->       3
j variable (20 values)                    ->   naics2
xij variables:
                  est11 est21 ... est99   ->   est
-----------------------------------------------------------------------------

. edit

. replace est = 0 if missing(est)
(366215 real changes made)

. egen sumzip = sum(est), by(zip)

. gen lnsumzip = ln(sumzip)

. poisson est lnsumzip i.naics2

Iteration 0:   log likelihood = -2195905.4  
Iteration 1:   log likelihood = -2092035.4  
Iteration 2:   log likelihood = -2088750.3  
Iteration 3:   log likelihood = -2088712.7  
Iteration 4:   log likelihood = -2088712.7  

Poisson regression                                Number of obs   =     793040
                                                  LR chi2(20)     =   2.33e+07
                                                  Prob > chi2     =     0.0000
Log likelihood = -2088712.7                       Pseudo R2       =     0.8482

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |          1   .0003224  3102.21   0.000     .9993682    1.000632
             |
      naics2 |
         21  |   .1026841   .0089698    11.45   0.000     .0851036    .1202645
         22  |  -.3493011   .0101127   -34.54   0.000    -.3691215   -.3294806
         23  |   3.535674   .0065973   535.93   0.000     3.522743    3.548604
         31  |   2.640039   .0067313   392.20   0.000     2.626846    2.653232
         42  |   2.910961   .0066779   435.91   0.000     2.897873     2.92405
         44  |   3.861167   .0065713   587.58   0.000     3.848288    3.874047
         48  |   2.229594   .0068441   325.77   0.000     2.216179    2.243008
         51  |   1.805126   .0070176   257.23   0.000     1.791371     1.81888
         52  |   3.067509   .0066528   461.08   0.000      3.05447    3.080548
         53  |   2.777383   .0067025   414.38   0.000     2.764246    2.790519
         54  |   3.602528   .0065913   546.56   0.000      3.58961    3.615447
         55  |   .7616493   .0078764    96.70   0.000     .7462118    .7770869
         56  |   2.788795   .0067002   416.22   0.000     2.775663    2.801927
         61  |    1.30156   .0073349   177.45   0.000     1.287184    1.315936
         62  |   3.501552   .0066006   530.49   0.000     3.488615    3.514489
         71  |   1.666936   .0070907   235.09   0.000     1.653039    1.680834
         72  |   3.286511   .0066237   496.18   0.000     3.273529    3.299493
         81  |   3.449228   .0066057   522.16   0.000     3.436281    3.462175
         99  |  -.8612614   .0119315   -72.18   0.000    -.8846468    -.837876
             |
       _cons |  -5.786475   .0068202  -848.43   0.000    -5.799843   -5.773108
------------------------------------------------------------------------------

. predict nhat, n

. su nhat, d

                 Predicted number of events
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0034006        .001297
 5%     .0155634        .001297
10%     .0374071        .001297       Obs              793040
25%     .1720204        .001297       Sum of Wgt.      793040

50%     .9698945                      Mean             9.7158
                        Largest       Std. Dev.      25.96819
75%     5.489295       1052.726
90%     27.48715       1100.877       Variance       674.3468
95%     54.46881       1125.512       Skewness        6.44306
99%     127.7478       1457.724       Kurtosis       95.81354

. gen lnn1 = ln(1+est)

. gen lnnhat1 = ln(1+nhat)

. scatter lnn1 lnnhat1 if naics==21

. scatter lnn1 lnnhat1 if naics==22

. reg lnn1 lnnhat1 if naics==22

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =10217.90
       Model |  1567.28638     1  1567.28638           Prob > F      =  0.0000
    Residual |  6081.76918 39650   .15338636           R-squared     =  0.2049
-------------+------------------------------           Adj R-squared =  0.2049
       Total |  7649.05556 39651  .192909525           Root MSE      =  .39165

------------------------------------------------------------------------------
        lnn1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lnnhat1 |   .5236659   .0051805   101.08   0.000      .513512    .5338199
       _cons |   .0834925   .0023821    35.05   0.000     .0788235    .0881614
------------------------------------------------------------------------------

. reg lnn1 lnnhat1 if naics==21

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) = 3676.10
       Model |  909.404552     1  909.404552           Prob > F      =  0.0000
    Residual |  9808.74355 39650  .247383192           R-squared     =  0.0848
-------------+------------------------------           Adj R-squared =  0.0848
       Total |  10718.1481 39651  .270312176           Root MSE      =  .49738

------------------------------------------------------------------------------
        lnn1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lnnhat1 |   .3109417   .0051284    60.63   0.000     .3008898    .3209936
       _cons |   .1194508   .0030833    38.74   0.000     .1134075     .125494
------------------------------------------------------------------------------

. reg lnn1 lnnhat1 if naics==23

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =       .
       Model |  78495.4369     1  78495.4369           Prob > F      =  0.0000
    Residual |  14041.9285 39650  .354146999           R-squared     =  0.8483
-------------+------------------------------           Adj R-squared =  0.8483
       Total |  92537.3654 39651  2.33379651           Root MSE      =   .5951

------------------------------------------------------------------------------
        lnn1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lnnhat1 |   .9540151   .0020264   470.79   0.000     .9500434    .9579869
       _cons |    .133195   .0048789    27.30   0.000     .1236321    .1427578
------------------------------------------------------------------------------

. reg lnn1 lnnhat1 if naics==31

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =       .
       Model |  51023.1076     1  51023.1076           Prob > F      =  0.0000
    Residual |  13549.2137 39650  .341720397           R-squared     =  0.7902
-------------+------------------------------           Adj R-squared =  0.7902
       Total |  64572.3214 39651  1.62851684           Root MSE      =  .58457

------------------------------------------------------------------------------
        lnn1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lnnhat1 |   .9207133   .0023827   386.41   0.000     .9160431    .9253836
       _cons |   .0260496   .0043389     6.00   0.000     .0175452     .034554
------------------------------------------------------------------------------

. reg lnn1 lnnhat1 if naics==32
no observations
r(2000);

. gen share = est/sumzip

. su share, d

                            share
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              793040
25%            0              0       Sum of Wgt.      793040

50%     .0074349                      Mean                .05
                        Largest       Std. Dev.      .0939214
75%     .0685714              1
90%     .1428571              1       Variance       .0088212
95%           .2              1       Skewness       4.523561
99%     .4313726              1       Kurtosis       35.61753

. scatter share lnsumzip if naics2==21

. reg share lnsumzip if naics2==21

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =  545.98
       Model |  1.66452228     1  1.66452228           Prob > F      =  0.0000
    Residual |  120.879373 39650   .00304866           R-squared     =  0.0136
-------------+------------------------------           Adj R-squared =  0.0136
       Total |  122.543895 39651  .003090563           Root MSE      =  .05521

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -.0032765   .0001402   -23.37   0.000    -.0035513   -.0030016
       _cons |   .0235568   .0005812    40.53   0.000     .0224178    .0246959
------------------------------------------------------------------------------

. reg share lnsumzip if naics2==22

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =  340.07
       Model |  .602488722     1  .602488722           Prob > F      =  0.0000
    Residual |  70.2453888 39650  .001771637           R-squared     =  0.0085
-------------+------------------------------           Adj R-squared =  0.0085
       Total |  70.8478775 39651  .001786787           Root MSE      =  .04209

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -.0019712   .0001069   -18.44   0.000    -.0021807   -.0017617
       _cons |   .0139676    .000443    31.53   0.000     .0130993    .0148359
------------------------------------------------------------------------------

. reg share lnsumzip 

      Source |       SS       df       MS              Number of obs =  793040
-------------+------------------------------           F(  1,793038) =    0.00
       Model |  1.8244e-08     1  1.8244e-08           Prob > F      =  0.9989
    Residual |   6995.5807793038  .008821243           R-squared     =  0.0000
-------------+------------------------------           Adj R-squared = -0.0000
       Total |   6995.5807793039  .008821232           Root MSE      =  .09392

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -1.11e-10   .0000533    -0.00   1.000    -.0001045    .0001045
       _cons |        .05    .000221   226.20   0.000     .0495668    .0504332
------------------------------------------------------------------------------

. reg share lnsumzip if naics2==31

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =   56.16
       Model |  .409252654     1  .409252654           Prob > F      =  0.0000
    Residual |  288.914308 39650  .007286616           R-squared     =  0.0014
-------------+------------------------------           Adj R-squared =  0.0014
       Total |  289.323561 39651  .007296753           Root MSE      =  .08536

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -.0016246   .0002168    -7.49   0.000    -.0020495   -.0011997
       _cons |   .0573832   .0008985    63.87   0.000     .0556222    .0591442
------------------------------------------------------------------------------

. tab naics

     naics2 |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |     39,652        5.00        5.00
         21 |     39,652        5.00       10.00
         22 |     39,652        5.00       15.00
         23 |     39,652        5.00       20.00
         31 |     39,652        5.00       25.00
         42 |     39,652        5.00       30.00
         44 |     39,652        5.00       35.00
         48 |     39,652        5.00       40.00
         51 |     39,652        5.00       45.00
         52 |     39,652        5.00       50.00
         53 |     39,652        5.00       55.00
         54 |     39,652        5.00       60.00
         55 |     39,652        5.00       65.00
         56 |     39,652        5.00       70.00
         61 |     39,652        5.00       75.00
         62 |     39,652        5.00       80.00
         71 |     39,652        5.00       85.00
         72 |     39,652        5.00       90.00
         81 |     39,652        5.00       95.00
         99 |     39,652        5.00      100.00
------------+-----------------------------------
      Total |    793,040      100.00

. reg share lnsumzip if naics2==42

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =  101.50
       Model |   .87522413     1   .87522413           Prob > F      =  0.0000
    Residual |  341.911791 39650  .008623248           R-squared     =  0.0026
-------------+------------------------------           Adj R-squared =  0.0025
       Total |  342.787015 39651  .008645104           Root MSE      =  .09286

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -.0023759   .0002358   -10.07   0.000    -.0028381   -.0019136
       _cons |   .0639062   .0009774    65.38   0.000     .0619905     .065822
------------------------------------------------------------------------------

. reg share lnsumzip if naics2==61

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =    4.49
       Model |  .007318969     1  .007318969           Prob > F      =  0.0340
    Residual |  64.5611736 39650  .001628277           R-squared     =  0.0001
-------------+------------------------------           Adj R-squared =  0.0001
       Total |  64.5684926 39651   .00162842           Root MSE      =  .04035

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |  -.0002173   .0001025    -2.12   0.034    -.0004181   -.0000164
       _cons |   .0110936   .0004247    26.12   0.000     .0102611     .011926
------------------------------------------------------------------------------

. reg share lnsumzip if naics2==51

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =    2.76
       Model |  .006707341     1  .006707341           Prob > F      =  0.0964
    Residual |  96.1889286 39650   .00242595           R-squared     =  0.0001
-------------+------------------------------           Adj R-squared =  0.0000
       Total |  96.1956359 39651  .002426058           Root MSE      =  .04925

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |    .000208   .0001251     1.66   0.096    -.0000372    .0004532
       _cons |   .0150498   .0005184    29.03   0.000     .0140337    .0160659
------------------------------------------------------------------------------

. reg share lnsumzip if naics2==44

      Source |       SS       df       MS              Number of obs =   39652
-------------+------------------------------           F(  1, 39650) =  202.45
       Model |  3.27773521     1  3.27773521           Prob > F      =  0.0000
    Residual |  641.936024 39650  .016190064           R-squared     =  0.0051
-------------+------------------------------           Adj R-squared =  0.0051
       Total |  645.213759 39651   .01627232           Root MSE      =  .12724

------------------------------------------------------------------------------
       share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .0045978   .0003231    14.23   0.000     .0039644    .0052311
       _cons |   .1208875   .0013392    90.27   0.000     .1182625    .1235125
------------------------------------------------------------------------------

. scatter share lnsumzip if naics2==44

. poisson est lnsumzip if naics2==44

Iteration 0:   log likelihood = -162780.54  
Iteration 1:   log likelihood = -158864.11  
Iteration 2:   log likelihood =  -158859.9  
Iteration 3:   log likelihood =  -158859.9  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      = 2435889.07
                                                  Prob > chi2     =     0.0000
Log likelihood =  -158859.9                       Pseudo R2       =     0.8846

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .9825582   .0008329  1179.70   0.000     .9809258    .9841907
       _cons |  -1.814303    .005375  -337.55   0.000    -1.824838   -1.803768
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==52

Iteration 0:   log likelihood = -114921.29  
Iteration 1:   log likelihood = -110421.42  
Iteration 2:   log likelihood = -110418.62  
Iteration 3:   log likelihood = -110418.62  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      = 1303589.76
                                                  Prob > chi2     =     0.0000
Log likelihood = -110418.62                       Pseudo R2       =     0.8551

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   1.147166   .0013955   822.02   0.000     1.144431    1.149901
       _cons |  -3.669788   .0092348  -397.39   0.000    -3.687888   -3.651688
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==61

Iteration 0:   log likelihood = -46525.804  
Iteration 1:   log likelihood = -45969.883  
Iteration 2:   log likelihood = -45969.791  
Iteration 3:   log likelihood = -45969.791  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =  209895.01
                                                  Prob > chi2     =     0.0000
Log likelihood = -45969.791                       Pseudo R2       =     0.6954

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   1.083386   .0032286   335.56   0.000     1.077058    1.089714
       _cons |  -5.020692   .0211728  -237.13   0.000     -5.06219   -4.979194
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==62

Iteration 0:   log likelihood = -160180.77  
Iteration 1:   log likelihood = -154874.79  
Iteration 2:   log likelihood = -154873.81  
Iteration 3:   log likelihood = -154873.81  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      = 1913799.60
                                                  Prob > chi2     =     0.0000
Log likelihood = -154873.81                       Pseudo R2       =     0.8607

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   1.093813   .0010827  1010.26   0.000     1.091691    1.095935
       _cons |  -2.888257   .0071112  -406.16   0.000    -2.902195   -2.874319
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==71

Iteration 0:   log likelihood = -71377.058  
Iteration 1:   log likelihood = -70952.775  
Iteration 2:   log likelihood = -70952.285  
Iteration 3:   log likelihood = -70952.285  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =  270133.39
                                                  Prob > chi2     =     0.0000
Log likelihood = -70952.285                       Pseudo R2       =     0.6556

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .9783423   .0024868   393.41   0.000     .9734682    .9832163
       _cons |   -3.98176   .0160367  -248.29   0.000    -4.013192   -3.950329
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==11

Iteration 0:   log likelihood = -48108.106  
Iteration 1:   log likelihood = -48108.101  
Iteration 2:   log likelihood = -48108.101  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =   12450.09
                                                  Prob > chi2     =     0.0000
Log likelihood = -48108.101                       Pseudo R2       =     0.1146

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .3826888   .0036223   105.65   0.000     .3755892    .3897883
       _cons |  -2.191563   .0194611  -112.61   0.000    -2.229706    -2.15342
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==21

Iteration 0:   log likelihood = -61915.537  
Iteration 1:   log likelihood = -61914.428  
Iteration 2:   log likelihood = -61914.428  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =   28288.75
                                                  Prob > chi2     =     0.0000
Log likelihood = -61914.428                       Pseudo R2       =     0.1860

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .5862358   .0039562   148.18   0.000     .5784818    .5939897
       _cons |  -3.180989    .023153  -137.39   0.000    -3.226368    -3.13561
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==22

Iteration 0:   log likelihood = -30516.662  
Iteration 1:   log likelihood = -30516.099  
Iteration 2:   log likelihood = -30516.099  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =   17413.99
                                                  Prob > chi2     =     0.0000
Log likelihood = -30516.099                       Pseudo R2       =     0.2220

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .5738893   .0049124   116.83   0.000     .5642612    .5835174
       _cons |  -3.563524   .0286251  -124.49   0.000    -3.619629    -3.50742
------------------------------------------------------------------------------

. poisson est lnsumzip if naics2==31

Iteration 0:   log likelihood = -145528.58  
Iteration 1:   log likelihood = -144899.26  
Iteration 2:   log likelihood = -144897.27  
Iteration 3:   log likelihood = -144897.27  

Poisson regression                                Number of obs   =      39652
                                                  LR chi2(1)      =  647633.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -144897.27                       Pseudo R2       =     0.6909

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    lnsumzip |   .8997404   .0014365   626.34   0.000     .8969248    .9025559
       _cons |  -2.513867   .0091303  -275.33   0.000    -2.531762   -2.495972
------------------------------------------------------------------------------

. anova est zip if est==31
matsize too small
    You have attempted to create a matrix with too many rows or columns or attempted to fit a model with too
    many variables.  You need to increase matsize; it is currently 400.  Use set matsize; see help matsize.

    If you are using factor variables and included an interaction that has lots of missing cells, either
    increase matsize or set emptycells drop to reduce the required matrix size; see help set emptycells.

    If you are using factor variables, you might have accidentally treated a continuous variable as a
    categorical, resulting in lots of categories.  Use the c. operator on such variables.
r(908);

. areg est if naics2==31, a(zip)

Linear regression, absorbing indicators           Number of obs   =      39652
                                                  F(   0,      0) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     1.0000
                                                  Root MSE        =     0.0000

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   8.356577          .        .       .            .           .
-------------+----------------------------------------------------------------
         zip |       F(39651, 0) =          .       .       (39652 categories)

. areg est i.naics2, a(zip)

Linear regression, absorbing indicators           Number of obs   =     793040
                                                  F(  19, 753369) =    6024.46
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.4724
                                                  Adj R-squared   =     0.4446
                                                  Root MSE        =    22.1147

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      naics2 |
         21  |    .064486   .1570591     0.41   0.681    -.2433447    .3723168
         22  |  -.1758045   .1570591    -1.12   0.263    -.4836353    .1320263
         23  |   19.86803   .1570591   126.50   0.000      19.5602    20.17586
         31  |   7.760264   .1570591    49.41   0.000     7.452434    8.068095
         42  |   10.36061   .1570591    65.97   0.000     10.05278    10.66844
         44  |   27.74095   .1570591   176.63   0.000     27.43312    28.04878
         48  |   4.947064   .1570591    31.50   0.000     4.639234    5.254895
         51  |   3.029708   .1570591    19.29   0.000     2.721878    3.337539
         52  |   12.21744   .1570591    77.79   0.000     11.90961    12.52527
         53  |   8.990543   .1570591    57.24   0.000     8.682712    9.298373
         54  |   21.28294   .1570591   135.51   0.000     20.97511    21.59077
         55  |   .6808736   .1570591     4.34   0.000     .3730428    .9887044
         56  |   9.100575   .1570591    57.94   0.000     8.792744    9.408406
         61  |   1.595153   .1570591    10.16   0.000     1.287322    1.902984
         62  |   19.18153   .1570591   122.13   0.000      18.8737    19.48936
         71  |   2.561712   .1570591    16.31   0.000     2.253881    2.869543
         72  |   15.35469   .1570591    97.76   0.000     15.04686    15.66252
         81  |   18.17328   .1570591   115.71   0.000     17.86545    18.48111
         99  |  -.3442954   .1570591    -2.19   0.028    -.6521261   -.0364646
             |
       _cons |   .5963129   .1110576     5.37   0.000     .3786437    .8139821
-------------+----------------------------------------------------------------
         zip |  F(39651, 753369) =     14.127   0.000       (39652 categories)

. help xtpoisson

. tsset zip naics2
       panel variable:  zip (strongly balanced)
        time variable:  naics2, 11 to 99, but with gaps
                delta:  1 unit

. xtpoisson est i.naics2, fe

--Break--
r(1);

. xtpoisson est i.naics2, re

Fitting Poisson model:

Iteration 0:   log likelihood =  -10662828  
Iteration 1:   log likelihood =  -10611234  
Iteration 2:   log likelihood =  -10609121  
Iteration 3:   log likelihood =  -10609106  
Iteration 4:   log likelihood =  -10609106  

Fitting full model:

Iteration 0:   log likelihood = -2228365.8  
Iteration 1:   log likelihood = -2212489.3  
Iteration 2:   log likelihood = -2212477.7  
Iteration 3:   log likelihood = -2212477.7  

Random-effects Poisson regression               Number of obs      =    793040
Group variable: zip                             Number of groups   =     39652

Random effects u_i ~ Gamma                      Obs per group: min =        20
                                                               avg =      20.0
                                                               max =        20

                                                Wald chi2(19)      =  3.39e+06
Log likelihood  = -2212477.7                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
         est |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      naics2 |
         21  |   .1026841   .0089698    11.45   0.000     .0851036    .1202645
         22  |  -.3493011   .0101127   -34.54   0.000    -.3691215   -.3294806
         23  |   3.535674   .0065973   535.93   0.000     3.522743    3.548604
         31  |   2.640039   .0067313   392.20   0.000     2.626846    2.653232
         42  |   2.910961   .0066779   435.91   0.000     2.897873     2.92405
         44  |   3.861167   .0065713   587.58   0.000     3.848288    3.874047
         48  |   2.229594   .0068441   325.77   0.000     2.216179    2.243008
         51  |   1.805126   .0070176   257.23   0.000     1.791371     1.81888
         52  |   3.067509   .0066528   461.08   0.000      3.05447    3.080548
         53  |   2.777383   .0067025   414.38   0.000     2.764246    2.790519
         54  |   3.602528   .0065913   546.56   0.000      3.58961    3.615447
         55  |   .7616493   .0078764    96.70   0.000     .7462118    .7770869
         56  |   2.788795   .0067002   416.22   0.000     2.775663    2.801927
         61  |    1.30156   .0073349   177.45   0.000     1.287184    1.315936
         62  |   3.501552   .0066006   530.49   0.000     3.488615    3.514489
         71  |   1.666936   .0070907   235.09   0.000     1.653039    1.680834
         72  |   3.286511   .0066237   496.18   0.000     3.273529    3.299493
         81  |   3.449228   .0066057   522.16   0.000     3.436281    3.462175
         99  |  -.8612668   .0119316   -72.18   0.000    -.8846523   -.8378814
             |
       _cons |  -.5169897   .0102532   -50.42   0.000    -.5370856   -.4968939
-------------+----------------------------------------------------------------
    /lnalpha |   .9129021     .00582                       .901495    .9243092
-------------+----------------------------------------------------------------
       alpha |   2.491543   .0145009                      2.463283    2.520127
------------------------------------------------------------------------------
Likelihood-ratio test of alpha=0: chibar2(01) =  1.7e+07 Prob>=chibar2 = 0.000

. 
