-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/zip_level_gradients.log
  log type:  text
 opened on:   8 Jun 2012, 16:18:13

. 
. local CBP ~/SparkleShare/County-Business-Patterns

. 
. * read zip-level population
. tempfile zippop

. insheet using `CBP'/population/zcta_county_rel_10.txt
(24 vars, 44410 obs)

. collapse (mean) zpop zhu zarealand, by(zcta5)

. ren zcta5 zip

. replace zarealand = zarealand/1e+6
(33120 real changes made)

. ren zarealand ziparea

. ren zpop pop

. ren zhu homes

. sort zip 

. save `zippop', replace
(note: file /tmp/St30023.000001 not found)
file /tmp/St30023.000001 saved

. 
. clear

. insheet using `CBP'/2007/zbp07detail.txt
(12 vars, 3340643 obs)

. 
. * drop sector totals, no new info
. drop if naics=="------"
(39652 observations deleted)

. BRK
unrecognized command:  BRK
r(199);

end of do-file

r(199);

. edit

. edit if substr(naics,5,1)=='-'
' invalid name
r(198);

. edit if substr(naics,5,1)=="-"

. tab naics if substr(naics,5,1)=="-"

      naics |      Freq.     Percent        Cum.
------------+-----------------------------------
     11---- |     10,358        2.43        2.43
     21---- |      8,534        2.00        4.43
     22---- |      9,139        2.14        6.57
     23---- |     31,544        7.39       13.96
     31---- |     25,724        6.03       19.98
     42---- |     26,399        6.18       26.17
     44---- |     31,740        7.44       33.61
     48---- |     26,342        6.17       39.78
     51---- |     18,562        4.35       44.13
     52---- |     25,584        5.99       50.12
     53---- |     22,239        5.21       55.33
     54---- |     26,348        6.17       61.50
     55---- |     11,081        2.60       64.10
     56---- |     25,573        5.99       70.09
     61---- |     15,448        3.62       73.71
     62---- |     25,958        6.08       79.79
     71---- |     19,797        4.64       84.43
     72---- |     28,530        6.68       91.11
     81---- |     32,017        7.50       98.62
     99---- |      5,908        1.38      100.00
------------+-----------------------------------
      Total |    426,825      100.00

. gen str naics3 = substr(naics,1,3)

. codebook naics3

-------------------------------------------------------------------------------------------
naics3                                                                          (unlabeled)
-------------------------------------------------------------------------------------------

                  type:  string (str3)

         unique values:  107                      missing "":  0/3300991

              examples:  "42-"
                         "453"
                         "54-"
                         "621"

. di 33000/130
253.84615

. xtpoisson establishment_size distance if sectorgroup==3 , i(msacode) fe
sectorgroup not found
r(111);

