-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/zip_level_gradients.log
  log type:  text
 opened on:   8 Jun 2012, 17:03:12

. 
. use ../data/zip_business_patterns

. 
. su sector

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      sector |     97512           2    .8165008          1          3

. local max `r(max)'

. 
. * nonparametric gradients
. local K 33

. egen distpct = cut(distance), group(`K')

. egen mean_emp_dens = mean(emp_dens), by(distpct sector)

. egen tag = tag(distpct sector)

. 
. gen ln_mean_emp_dens = ln(mean_emp_dens)

. 
. tw (line ln_mean_emp_dens distance if tag&sector==1&distance<=100, sort) /*
> */ (line ln_mean_emp_dens distance if tag&sector==2&distance<=100, sort) /*
> */ (line ln_mean_emp_dens distance if tag&sector==3&distance<=100, sort) /*
> */, legend(order(1 "Agriculture" 2 "Manufacturing" 3 "Services")) scheme(s2color)

. 
. preserve

. * calculate shares
. collapse emp est lndistance distance, by(sector distpct)

. reshape wide emp est, i(distpct) j(sector)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       99   ->      33
Number of variables                   6   ->       9
j variable (3 values)            sector   ->   (dropped)
xij variables:
                                    emp   ->   emp1 emp2 emp3
                                    est   ->   est1 est2 est3
-----------------------------------------------------------------------------

. egen totalemp = rsum(emp?)

. sort distance

. forval i=1/`max' {
  2.         gen share`i' = emp`i'/totalemp
  3.         gen lnshare`i' = ln(emp`i'/totalemp)
  4.         gen share`i'norm = ln(share`i'/share`i'[1])
  5. }

. tw (line share?norm lndistance, sort), legend(order(1 "Agriculture" 2 "Manufacturing" 3 "
> Services")) scheme(s2color)

. 
. restore

. 
. 
. * sector-level regressions
. gen lower = 0

. gen upper = 500

. replace upper = 20 if sector==3
(32504 real changes made)

. replace lower = 20 if sector==2
(32504 real changes made)

. replace upper = 100 if sector==2
(32504 real changes made)

. replace lower = 100 if sector==1
(32504 real changes made)

. 
. egen msacode = group(msa)

. 
. foreach X in emp_density establishment_size imputed_density {
  2.         gen tau_`X' = .
  3.         forval i = 1/`max' {
  4.                 xtpoisson `X' distance if sector==`i' & distance>=lower & distance<upp
> er, i(msacode) fe
  5.                 replace tau_`X' = _b[distance] if sector==`i'
  6.         }
  7. }
(97512 missing values generated)
note: you are responsible for interpretation of non-count dep. variable
note: 3 groups (3 obs) dropped because of only one obs per group
note: 2 groups (7 obs) dropped because of all zero outcomes

Iteration 0:   log likelihood = -576.67497  
Iteration 1:   log likelihood = -576.61055  
Iteration 2:   log likelihood = -576.61038  
Iteration 3:   log likelihood = -576.61038  

Conditional fixed-effects Poisson regression    Number of obs      =      1838
Group variable: msacode                         Number of groups   =        20

                                                Obs per group: min =         3
                                                               avg =      91.9
                                                               max =       342

                                                Wald chi2(1)       =      0.12
Log likelihood  = -576.61038                    Prob > chi2        =    0.7242

------------------------------------------------------------------------------
 emp_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    distance |  -.0007855   .0022259    -0.35   0.724    -.0051481    .0035771
------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood = -2047408.7  
Iteration 1:   log likelihood = -2045618.9  
Iteration 2:   log likelihood = -2045617.1  
Iteration 3:   log likelihood = -2045617.1  

Conditional fixed-effects Poisson regression    Number of obs      =     18257
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =         2
                                                               avg =     146.1
                                                               max =       445

                                                Wald chi2(1)       =   3501.43
Log likelihood  = -2045617.1                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 emp_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    distance |  -.0065177   .0001101   -59.17   0.000    -.0067336   -.0063018
------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood =  -49896691  
Iteration 1:   log likelihood =  -26521141  
Iteration 2:   log likelihood =  -26520966  
Iteration 3:   log likelihood =  -26520966  

Conditional fixed-effects Poisson regression    Number of obs      =     12089
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =        10
                                                               avg =      96.7
                                                               max =       654

                                                Wald chi2(1)       =  2.13e+07
Log likelihood  =  -26520966                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 emp_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    distance |  -.4583657   .0000994 -4610.84   0.000    -.4585605   -.4581708
------------------------------------------------------------------------------
(32504 real changes made)
(97512 missing values generated)
note: you are responsible for interpretation of non-count dep. variable
note: 3 groups (3 obs) dropped because of only one obs per group

Iteration 0:   log likelihood = -4870.8206  
Iteration 1:   log likelihood = -4870.3832  
Iteration 2:   log likelihood =  -4870.383  

Conditional fixed-effects Poisson regression    Number of obs      =       679
Group variable: msacode                         Number of groups   =        18

                                                Obs per group: min =         2
                                                               avg =      37.7
                                                               max =       153

                                                Wald chi2(1)       =      0.87
Log likelihood  =  -4870.383                    Prob > chi2        =    0.3523

------------------------------------------------------------------------------------
establishment_size |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
          distance |  -.0003965   .0004262    -0.93   0.352    -.0012318    .0004389
------------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood = -225894.73  
Iteration 1:   log likelihood = -225883.34  
Iteration 2:   log likelihood = -225883.34  

Conditional fixed-effects Poisson regression    Number of obs      =     16518
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =         2
                                                               avg =     132.1
                                                               max =       417

                                                Wald chi2(1)       =     22.74
Log likelihood  = -225883.34                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------------
establishment_size |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
          distance |  -.0006613   .0001387    -4.77   0.000    -.0009332   -.0003895
------------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood = -111765.78  
Iteration 1:   log likelihood = -107994.85  
Iteration 2:   log likelihood = -107994.83  
Iteration 3:   log likelihood = -107994.83  

Conditional fixed-effects Poisson regression    Number of obs      =     12045
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =        10
                                                               avg =      96.4
                                                               max =       654

                                                Wald chi2(1)       =   7481.52
Log likelihood  = -107994.83                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------------
establishment_size |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
          distance |   -.036622   .0004234   -86.50   0.000    -.0374518   -.0357922
------------------------------------------------------------------------------------
(32504 real changes made)
(97512 missing values generated)
note: you are responsible for interpretation of non-count dep. variable
note: 3 groups (3 obs) dropped because of only one obs per group

Iteration 0:   log likelihood =  -171155.1  
Iteration 1:   log likelihood = -169879.21  
Iteration 2:   log likelihood = -169877.49  
Iteration 3:   log likelihood = -169877.49  

Conditional fixed-effects Poisson regression    Number of obs      =       679
Group variable: msacode                         Number of groups   =        18

                                                Obs per group: min =         2
                                                               avg =      37.7
                                                               max =       153

                                                Wald chi2(1)       =   2428.69
Log likelihood  = -169877.49                    Prob > chi2        =    0.0000

---------------------------------------------------------------------------------
imputed_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       distance |  -.0046452   .0000943   -49.28   0.000    -.0048299   -.0044604
---------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood =  -11616908  
Iteration 1:   log likelihood =  -11486318  
Iteration 2:   log likelihood =  -11486262  
Iteration 3:   log likelihood =  -11486262  

Conditional fixed-effects Poisson regression    Number of obs      =     16518
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =         2
                                                               avg =     132.1
                                                               max =       417

                                                Wald chi2(1)       = 243189.61
Log likelihood  =  -11486262                    Prob > chi2        =    0.0000

---------------------------------------------------------------------------------
imputed_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       distance |   -.016992   .0000345  -493.14   0.000    -.0170596   -.0169245
---------------------------------------------------------------------------------
(32504 real changes made)
note: you are responsible for interpretation of non-count dep. variable

Iteration 0:   log likelihood =  -50378951  
Iteration 1:   log likelihood =  -27457594  
Iteration 2:   log likelihood =  -27449209  
Iteration 3:   log likelihood =  -27449207  

Conditional fixed-effects Poisson regression    Number of obs      =     12045
Group variable: msacode                         Number of groups   =       125

                                                Obs per group: min =        10
                                                               avg =      96.4
                                                               max =       654

                                                Wald chi2(1)       =  2.90e+07
Log likelihood  =  -27449207                    Prob > chi2        =    0.0000

---------------------------------------------------------------------------------
imputed_density |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       distance |   -.278594   .0000517 -5384.32   0.000    -.2786955   -.2784926
---------------------------------------------------------------------------------
(32504 real changes made)

. table sector, c(mean tau_emp_density mean tau_establishment_size mean tau_imputed_density
> )

----------------------------------------------------------
   sector | mean(tau_em~y)  mean(tau_es~e)  mean(tau_im~y)
----------+-----------------------------------------------
        1 |      -.0007855       -.0003965       -.0046452
        2 |      -.0065177       -.0006613        -.016992
        3 |      -.4583657        -.036622        -.278594
----------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /media/home/share/Dropbox/projects/balassa/code/../doc/zip_level_gradients.log
  log type:  text
 closed on:   8 Jun 2012, 17:03:40
-------------------------------------------------------------------------------------------
